from mengzi_fine_tuning.model import MengziZeroShot


def prompt(inputStr: str):
    return f"聊天内容：【{inputStr.strip()}】\n题目：请总结聊天内容。答："


model = MengziZeroShot(
    modelSubDir="fine_tuning",
    dataSubdir="sum",
    # promptBuilder=prompt,
)

inputs = [
    "1+1",
    "1+3",
    "5+6",
    "7+1",
    # "今天天气不错",
    # "你好啊？",
    # "今天天气不错",
    # "你是谁？",
    # "感觉生活好难。前年来深圳的时候租的 1600 的小单间，没有采光暗无天日。现在租的 2400 的大单间，房间品质还是很恶劣。南山上班，想要 40 分钟内的通勤，一个人住得舒服点，3000 是少不了的。其他物价其实跟二三线城市相比也贵不了多少。",
    # "自从乔纳森离职了产品设计就在走下坡了，除了iPad watch和AirPods是因为还是用之前的外观之外，iPhone、mac都在倒退",
    # "就现在新显存版本的溢价，足够矿卡翻新的成本。其一，就算矿卡也不降价销售卖。其二，老系列矿卡人人皆知，换个系列充新卖。",
    # "但问题是价格合适的都是真正的矿卡。比如1500左右的3060矿卡；华硕这种3060TI想要卖的出去只能和矿卡拼价格。对消费者来说，买矿卡还是要碰运气的。毕竟谁也保不住用上1年半载就出问题，修都没得休，还不如老实点入手正规的卡，好歹有质保。矿卡虽然会降价，但矿卡的质保始终是个问题。",
    # "我上个月帮同事2500买了个3070ti，说个人非矿，本地自提，有包装，我跑甜甜圈半小时也没有任何异常，反正也在保，我觉得就很划算",
    # "3060Ti还是值得买的，性能不错功耗也不高，550W金牌电源就绰绰有余",
]

# model.train()

outputs = model.inference(inputs)
